// 식단 정보를 미리 변수로 저장 (Local Fetch 시 보안 문제 방지)
const DIET_DATA_VARIABLE = [
  {
    "식단ID": 1,
    "날짜": "2025-03-12",
    "식사구분": "점심",
    "음식": [
      {
        "식품코드": "D220-740000000-0050",
        "식품명": "아이스티_아이스티 샷추가 (L)",
        "에너지": 190.49,
        "탄수화물": 0.0,
        "단백질": 1.07,
        "지방": 0.0,
        "식품중량": "464g"
      }
    ]
  },
  {
    "식단ID": 2,
    "날짜": "2025-04-19",
    "식사구분": "아침",
    "음식": [
      {
        "식품코드": "D202-111000000-0019",
        "식품명": "크로와상_미니크로와상",
        "에너지": 59.04,
        "탄수화물": 0.0,
        "단백질": 1.0,
        "지방": 0.0,
        "식품중량": "16g"
      }
    ]
  },
  {
    "식단ID": 3,
    "날짜": "2025-01-24",
    "식사구분": "점심",
    "음식": [
      {
        "식품코드": "D303-150060000-0001",
        "식품명": "만두_김치만두",
        "에너지": 187.0,
        "탄수화물": 23.82,
        "단백질": 8.13,
        "지방": 6.59,
        "식품중량": "100g"
      }
    ]
  },
  {
    "식단ID": 4,
    "날짜": "2025-02-20",
    "식사구분": "간식",
    "음식": [
      {
        "식품코드": "D202-120000000-2608",
        "식품명": "피자_불고기 체다 스타라이트 피자 씬 (L)",
        "에너지": 1468.76,
        "탄수화물": 107.59,
        "단백질": 63.88,
        "지방": 86.62,
        "식품중량": "503g"
      }
    ]
  },
  {
    "식단ID": 5,
    "날짜": "2025-04-25",
    "식사구분": "저녁",
    "음식": [
      {
        "식품코드": "D202-095000000-0077",
        "식품명": "베이글_블루베리 베이글",
        "에너지": 315.52,
        "탄수화물": 58.0,
        "단백질": 8.0,
        "지방": 44.0,
        "식품중량": "116g"
      }
    ]
  },
  {
    "식단ID": 6,
    "날짜": "2025-02-10",
    "식사구분": "간식",
    "음식": [
      {
        "식품코드": "D202-095000000-0053",
        "식품명": "베이글_플레인 베이글허니월넛크림치즈",
        "에너지": 289.75,
        "탄수화물": 0.0,
        "단백질": 7.0,
        "지방": 0.0,
        "식품중량": "95g"
      },
      {
        "식품코드": "D219-709000000-0011",
        "식품명": "빙수_돼지바 얼음빙수",
        "에너지": 896.04,
        "탄수화물": 0.0,
        "단백질": 11.22,
        "지방": 0.0,
        "식품중량": "342g"
      }
    ]
  },
  {
    "식단ID": 7,
    "날짜": "2025-03-13",
    "식사구분": "점심",
    "음식": [
      {
        "식품코드": "D109-417120000-0001",
        "식품명": "달걀부침(달걀후라이)_햄",
        "에너지": 277.0,
        "탄수화물": 8.06,
        "단백질": 12.71,
        "지방": 21.59,
        "식품중량": "100g"
      }
    ]
  }
];
